app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all.order(:due_date , status: :desc)
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."due_date" ASC, "tasks"."status" DESC

  def show
    id = params[:id].to_i
    @task = Task.find_by(id: id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @task = Task.new(name: params[:task][:name], description: params[:task][:description], due_date: params[:task][:due_date], status: "Incomplete") #instantiate a new book
    if @task.save # save returns true if the database insert succeeds
      redirect_to root_path # go to the index so we can see the book in the list
    else # save failed :(
      render :new # show the new book form view again
    end
  end

  def new
    @task = Task.new(status: "Incomplete")
  end

  def edit
    @task = Task.find(params[:id].to_i)

  end

  def update
    @task = Task.find(params[:id].to_i)
    @task.name = params[:task][:name]
    @task.description = params[:task][:description]
    @task.due_date = params[:task][:due_date]

    @task.save # save returns true if the database insert succeeds
    redirect_to task_path # go to the index so we can see the book in the list
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "due_date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Complete Wave 4"], ["description", "Delete function"], ["created_at", "2018-09-19 23:59:57.436621"], ["updated_at", "2018-09-19 23:59:57.436621"], ["due_date", "September 20, 2018"]]
SELECT  "tasks".* FROM "tasks" WHERE (1) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "Weekend Warrior"], ["description", "Create the song"], ["updated_at", "2018-09-21 16:53:31.807827"], ["id", 17]]

  def destroy
    @task = Task.find(params[:id].to_i)
    @task.destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]

  def complete
    @task = Task.find(params[:id].to_i)
    if @task.completion_date == nil
      @task.status = "Complete"
      @task.completion_date = Date.today
    else
      @task.status = "Incomplete"
      @task.completion_date = nil
    end
    @task.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "status" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completion_date", "2018-09-19"], ["status", "Complete"], ["updated_at", "2018-09-20 01:17:39.146906"], ["id", 17]]