app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" ASC
---
  def index
    @tasks = Task.all.order(:completion_date)